#include <stdio.h>

int main(void)
{
	if (1)
		printf("AAAA\n");
	else if (2)
		printf("BBBB\n");
	else
		printf("CCCC\n");

	return 0;
}

/**************************************************************************
时间：2015年4月6日22:44:21
目的：验证if...else...后两个判定表达式都为真时的执行情况
功能：一组if...else...语句中的两个if后判定都为真时输出对应值验证
其他：当出现这种情况时，只判定到第一个为真的判定表达式即停止该组if...else...
在VC中的输出结果为：
---------------------------------------------------------------------------
AAAA
Press any key to continue
---------------------------------------------------------------------------
**************************************************************************/