#include <stdio.h>

int main(void)
{
	int i = 47;

	printf("printf函数使用方法简介：\n");
	printf("十进制输出：i = %#d\n", i);
	printf("十六进制输出：i = %#X\n", i);
	printf("八进制输出：i = %#o\n", i);

	return 0;
}

/*******************************************
时间：2015年3月31日23:07:15
目的：改进进制输出
功能：分别以不同进制输出一个整型数
其他：加#可改进进制输出的形式
VC中的输出结果：
--------------------------------------------
	 printf函数使用方法简介：
	十进制输出：i = 47
	十六进制输出：i = 0X2F
	八进制输出：i = 057
	Press any key to continue
--------------------------------------------
*******************************************/