# include <stdio.h>

int main(void)
{
	int i = 15;
	
	//printf("二进制表示为：i = %b\n", i);
	printf("八进制表示为：i = %o\n", i);
	printf("十进制表示为：i = %d\n", i);
	printf("十六进制表示为：i = %x or %X\n", i, i);

	return 0;
}

/*********************************************
时间：2015年3月31日23:02:56
目的：printf输入控制符检验
功能：分别用八进制十进制十六进制来输出一个整数
其他：识记输出控制符号
VC中的输出结果：
----------------------------------------------
	八进制表示为：i = 17
	十进制表示为：i = 15
	十六进制表示为：i = f or F
	Press any key to continue
----------------------------------------------
*********************************************/