#include <stdio.h>

int main()
{
	int val;

	printf("请输入您要到的楼层：floor = ");
	scanf("%d", &val);

	switch (val)
	{
		
	case 1:
		printf("1层到！\n"); 
		break;
	case 2:
		printf("2层到！\n");
		break;
	case 3:
		printf("3层到！\n");
		break;
	case 4:
		printf("4层到！\n");
		break;
	default:
		printf("无该楼层，闹鬼了！\n");
		break;
	}

	return 0;
}

/**************************************************************************
时间：2015年4月22日23:13:08
目的：练习switch
功能：模拟电梯楼层
其他：注意中文字符输入引起的错误
在VC中的输出结果为：
---------------------------------------------------------------------------
请输入您要到的楼层：floor = 2
2层到！
Press any key to continue
---------------------------------------------------------------------------
**************************************************************************/