#include <stdio.h>

int main(void)
{
	int i, j;
	
	printf("依次输入两个整数，并以空格隔开：");
	scanf("%d %d", &i, &j);
	printf("i = %d, j = %d\n", i, j);

	if (i > j)
		printf("i大于j\n");
	else if (i < j)
		printf("i小于j\n");
	else 
		printf("i等于j\n");

	printf("比较完毕\n");

	return 0;
}

/********************************************
时间：2015年4月6日16:03:49
目的：认识if...else...语句
功能：比较两个整数的大小
其他：A、VC中文件名如果有“.”则在其后补全文件扩展名，否则无法编译
	  B、if和下面的else之间是一个完整的表达式，如若有多个就加括号括起来，否则会报错
在VC中的输出结果为：
-----------------------------------------------
依次输入两个整数，并以空格隔开：12 13
i = 12, j = 13
i小于j
比较完毕
Press any key to continue
-----------------------------------------------
********************************************/